import re
import os
import json
from .unicodedata2 import script_cat
from typing import DefaultDict, Any, List
from typing import Dict, List, Optional, Tuple
from .inverse_text_normalization.run_predict import inverse_normalize_text
itn_lang_codes = {
    "assamese": "asm",
    "bengali": "bn",
    "english": "en",
    "gujarati": "gu",
    "hindi": "hi",
    "kannada": "kn",
    "malayalam": "ml",
    "marathi": "mr",
    "odia": "ori",
    "punjabi": "pa",
    "tamil": "ta",
    "telugu": "te",
}

# class TrieNode:
#     def __init__(self):
#         self.children = defaultdict(TrieNode)
#         self.is_end = False
#         self.word = None

# class Trie:
#     def __init__(self):
#         self.root = TrieNode()

#     def insert(self, word: str):
#         node = self.root
#         for char in word:
#             node = node.children[char]
#         node.is_end = True
#         node.word = word

#     def search(self, word: str) -> str:
#         node = self.root
#         for char in word:
#             if char not in node.children:
#                 return None
#             node = node.children[char]
#         if node.is_end:
#             return node.word
#         return None
        

class TextToInt:
    def __init__(
        self,
        subs_file: os.PathLike = "./config/subs.json",
        itn_standardizations_file: Optional[os.PathLike] = None,
    ):

        with open(subs_file) as f:
            self.text_to_int_map = json.loads(f.read())

        if itn_standardizations_file is not None:
            with open(itn_standardizations_file) as g:
                self.itn_standardizations = json.loads(g.read())

    def indic_punct_replacements(self, text: str, lang: str) -> str:
        """Standardizes text so that the numerical words match
        the ones specified in indic punct.
        
        To IMPROVE: Use a trie based matching then replace.
        """

        def _recurse(text: str, replacements_dict: Dict,):
            def replace_using_list(text: str, words: List[str]) -> str:
                """Replaces all occurrences of any word in words[1:] with words[0]"""
                if len(words) == 0:
                    return text
                replace_with = words[0]
                for word in words:
                    word = " " + word.strip() + " "
                    text = " " + text.strip() + " "
                    text = text.replace(word, " " + replace_with.strip() + " ")
                return text

            if type(replacements_dict) is list:
                return replace_using_list(text, words)

            elif type(replacements_dict) is dict:
                for replace_with, words in replacements_dict.items():
                    # As thousands dictionary can have million etc. too
                    if type(words) is dict:
                        text = _recurse(text, words)
                    else:
                        text = replace_using_list(text, words)
                return text

            else:
                raise ValueError(
                    f"Check itn_standardizations.json. Found\
                    {replacements_dict} as a value, which is  neither dict, nor list."
                )

        return _recurse(text, self.itn_standardizations[lang])

    # def indic_punct_replacements(self, text: str, lang: str) -> str:
    #     """Standardizes text so that the numerical words match
    #     the ones specified in indic punct."""
        
    #     # Build trie
    #     trie = Trie()
    #     for replace_with, words in self.itn_standardizations[lang].items():
    #         for word in words:
    #             trie.insert(word.strip())

    #     # Replace using trie
    #     def replace_using_trie(text: str) -> str:
    #         output = []
    #         i = 0
    #         while i < len(text):
    #             j = i + 1
    #             node = trie.root
    #             while j <= len(text) and text[i:j] in node.children:
    #                 node = node.children[text[i:j]]
    #                 j += 1
    #                 if node.is_end:
    #                     output.append(node.word)
    #                     break
    #             else:
    #                 output.append(text[i])
    #                 j = i + 1
    #             i = j - 1
    #         return "".join(output)

    #     return replace_using_trie(text)

    def indic_punct_itn(self, text: str, lang: str, replace_commas: bool=True) -> str:

        if hasattr(self, "itn_standardizations"):
            text = self.indic_punct_replacements(text, lang)
        else:
            print(
                "Running indic-punct ITN without performing any replacements. \
                To run otherwise, specify path to a itn_standardizations_file in TextToInt() creation."
            )
        # print("indic punct in :", text)
        indic_punct_out = inverse_normalize_text([text], itn_lang_codes[lang])[0]
        # print("indic punct out:", indic_punct_out)
        if replace_commas:
            indic_punct_out = indic_punct_out.replace(",", "")
        return indic_punct_out

    def convert_text_to_int(
        self, text: str, use_itn: Optional[bool] = False, lang: str = None
    ) -> str:

        if use_itn:
            if lang is None:
                raise ValueError("Language needed for Indic punct.")
            return self.indic_punct_itn(text, lang)

        text = (
            " " + text.strip() + " "
        )  # Add spaces for proper replacement of first and last words of text.
        for script in set([script_cat(ch)[0] for ch in text]).union(
            set(["Common", "Latin", "Devanagari"])
        ):
            for x, y in self.text_to_int_map[script].items():
                text = text.replace(x, y)
        return text

class TextToIntOld():
        
    def convert_hindi_text_to_int(self,text):
        text = re.sub(r'-', ' - ', text)                                    # To include the Interval days 
        text = re.sub(r' ट्वेंटी ओने | ट्वेंटी वन | इक्कीश | इक्कीस | ट्वेंटी फर्स्ट | 21st | twenty first | twenty one ', ' 21 ', text)
        text = re.sub(r' ट्वेंटी ट्व | वेंटी तवो | बाइश | बाइस | बाईस | बायस | ट्वेंटी सेकंड | 22nd | twenty two | twenty second ', ' 22 ', text)
        text = re.sub(r' ट्वेंटी थ्री | तेईस | तेइश | तैश | तेइस | तेइश | ट्वेंटी थर्ड | 23rd | twenty three | twenty third ', ' 23 ', text)
        text = re.sub(r' ट्वेंटी फोर | चौबीस | चौबीश | ट्वेंटी फोर्थ | 24th | twenty four | twenty fourth ', ' 24 ', text)
        text = re.sub(r' ट्वेंटी फाइव | च्चीस | पच्चिस | पचीस | पच्चीश | पच्चीस | पच्चिश | ट्वेंटी फिफ्थ | 25th | twenty five | twenty fifth ', ' 25 ', text)
        text = re.sub(r' ट्वेंटी सिक्स | छबीस | छब्बीस | छबिश | छब्बीस | छबीश | ट्वेंटी सिक्स्थ | 26th | twenty six | twenty sixth ', ' 26 ', text)
        text = re.sub(r' ट्वेंटी सेवन | सत्ताईश | सत्ताइश | सत्ताईस | सत्ताइस | ट्वेंटी सेवंथ | 27th | twenty seven | twenty seventh ', ' 27 ', text)
        text = re.sub(r' ट्वेंटी आठ | अठाइस | अठाईस | अट्ठाईस | ट्वेंटी एर्थ | 28th | twenty eight | twenty eighth ', ' 28 ', text)
        text = re.sub(r' ट्वेंटी नाइन | उन्तिश | उन्तीस | उनतीस | उनतीश | ट्वेंटी नाइंथ | 29th | twenty nine | twenty ninth ', ' 29 ', text)
        text = re.sub(r' थर्टी ओने | थर्टी वन | क्कतीस | इक्कातिश | इक्कातिष | इक्कतीश | इक्कतीष | इक्कटिश | थर्टी फर्स्ट | 31st | thirty one | thirty first ', ' 31 ', text)
        text = re.sub(r' वन | एक | पहली | पहला | फर्स्ट | 1st | one | first ', ' 1 ', text)
        text = re.sub(r' ट्व | टू | तवो | दो | दूसरा | दूसरी | दूसरे | सेकंड | 2nd | two | second ', ' 2 ', text)
        text = re.sub(r' थ्री | तीन | तिन | तीसरा | तीसरे |तीसरी | थर्ड | 3rd | third | three ', ' 3 ', text)
        text = re.sub(r' फोर | चार | चौथी | चौथा | चौथे | फोर्थ | 4th | fourth | four ', ' 4 ', text)
        text = re.sub(r' फाइव | पांच | पांचवी | पांचवीं | पाँचवीं | पाँच | पॉंचवी | पांचवा | पाँचवा | पांचवे | पाँचवे | फिफ्थ | 5th | fifth | five ', ' 5 ', text)
        text = re.sub(r' सिक्स | छे | छ |छह | छटवी | छठवी | छठवीं | छटवा | छठवा | छठवाँ | छटवे | छटवें | छठवे | छठवें |स िक्स्थ | सिक्स | 6th | sixth | six ', ' 6 ', text)
        text = re.sub(r' सेवन | सात | सातवा | सातवे | सातवें | सातवीं | सातवी | सेवंथ | 7th | seventh | seven ', ' 7 ', text)
        text = re.sub(r' आठ | आठवीं | आठवी | आठवा | आठवां | आठवाँ | आठवे | आठवें | एर्थ | 8th | eighth | eight ', ' 8 ', text)
        text = re.sub(r' नाइन | नौ | नो | नव | नौवा | नौवां | नौवाँ | नौवे | नौवें | नेहला | नहला | नौमी | नौवीं | नौवी | नाइंथ | 9th | ninth | nine ', ' 9 ', text)
        text = re.sub(r' तेन | दस | दसवीं | दसवी | दसवा | दसवां | दसवे | दसवें | टेंथ | 10th | ten | tenth ', ' 10 ', text)
        text = re.sub(r' एलेवेन | ग्यारह | ग्यारा | गयरा | ग्याराह | ग्यारवां | ग्यारवाँ | ग्यारवे | ग्यारवें | इलेवंथ | 11th | eleven | eleventh ', ' 11 ', text)
        text = re.sub(r' ट्वेल्व | बारह | बारवा | बारवां | बारा | बारवी | बारवीं | बारहवीं | बारहवी | ट्वेल्थ | 12th | twelve | twelveth | twelfth | बारा ', ' 12 ', text)
        text = re.sub(r' थर्टीन | तेरह | तेरा | तेरहवी | तेरहवीं | थर्टीन्थ | 13th | thirteen | thirteenth ', ' 13 ', text)
        text = re.sub(r' फोर्टीन | चौदा | चोदा | चौदह | फोर्टीन्थ | 14th | forteen | forteenth ', ' 14 ', text)
        text = re.sub(r' फिफ्टीन | पंदरा | पंद्रह | फिफ्टीन्थ | 15th | fifteen | fifteenth ', ' 15 ', text)
        text = re.sub(r' सिक्सटीन | सोला | सोलह | सिक्सटीन्थ | 16th | sixteen | sixteenth ', ' 16 ', text)
        text = re.sub(r' सेवेनटीन | सत्रह | सत्रा | सेवेंटींथ | 17th | seventeen | seventeenth ', ' 17 ', text)
        text = re.sub(r' एटीन | तअठारह | अठरह | अठारह | अठारा | अटारा |एटीन्थ | 18th | eighteen | eighteenth ', ' 18 ', text)
        text = re.sub(r' नाइनटीन | उन्नीस | नाइनटींथ | 19th | nineteen | nineteenth ', ' 19 ', text)
        text = re.sub(r' ट्वेंटी | बीस | बीश | बीष | ट्वंटिएथ | 20th | twenty | twentieth ', ' 20 ', text)
        text = re.sub(r' थर्टी | टीश | तीस | तीष | तीश | थर्टेयथ | 30th | thirty | thirteenth ', ' 30 ', text)
        return text
    
    def convert_marathi_text_to_int(self, text):
        text = re.sub(r'-', ' - ', text)                                    # To include the Interval days 
        text = re.sub(r' एकवीस | ट्वेंटी फर्स्ट | 21st ', ' 21 ', text)
        text = re.sub(r' बावीस | ट्वेंटी सेकंड | 22nd ', ' 22 ', text)
        text = re.sub(r' तेवीस | ट्वेंटी थर्ड | 23rd ', ' 23 ', text)
        text = re.sub(r' चोवीस | ट्वेंटी फोर्थ | 24th ', ' 24 ', text)
        text = re.sub(r' पंचवीस | ट्वेंटी फिफ्थ | 25th ', ' 25 ', text)
        text = re.sub(r' सौवीस | ट्वेंटी सिक्स्थ | 26th ', ' 26 ', text)
        text = re.sub(r' सत्तावीस | ट्वेंटी सेवंथ | 27th ', ' 27 ', text)
        text = re.sub(r' अठावीस | ट्वेंटी एर्थ | 28th ', ' 28 ', text)
        text = re.sub(r' एकोणतीस | ट्वेंटी नाइंथ | 29th ', ' 29 ', text)
        text = re.sub(r' एकतीस | थर्टी फर्स्ट | 31st ', ' 31 ', text)
        text = re.sub(r' एक | पहली | पहला | पहिली | पहिला | फर्स्ट | वन | 1st | एका ', ' 1 ', text)
        text = re.sub(r' दोन | दुसरा | दूसरा | दुसरे | दूसरी | सेकंड | 2nd ', ' 2 ', text)
        text = re.sub(r' तीन | तीसरा | तीसरे | तीसरी | थर्ड | 3rd ', ' 3 ', text)
        text = re.sub(r' चार | चौथी | फोर्थ | 4th ', ' 4 ', text)
        text = re.sub(r' पांच | पाच | पाचवी | फिफ्थ | 5th ', ' 5 ', text)
        text = re.sub(r' साहा | सहा | सहावी | सिक्सथ | 6th ', ' 6 ', text)
        text = re.sub(r' सात | सातव्या | सातवीं | सातवी | सेवंथ | 7th ', ' 7 ', text)
        text = re.sub(r' आठ | आठवी | आठवा | आठवाँ | एथ | 8th ', ' 8 ', text)
        text = re.sub(r' नऊ | नौ | नव | नौवा | नौवां | नौवाँ | नौवे | नौवें | नौवी | नाइंथ | 9th ', ' 9 ', text)
        text = re.sub(r' दहा | दाहा | दहावी | दाहावी | टेंथ | 10th ', ' 10 ', text)
        text = re.sub(r' अकरा | इलेवंथ | 11th ', ' 11 ', text)
        text = re.sub(r' बारा | बारावी | बारवी | बारहवी | ट्वेल्थ | 12th ', ' 12 ', text)
        text = re.sub(r' तेरा | तेरावी | तेरवी | थर्टीन्थ | 13th ', ' 13 ', text)
        text = re.sub(r' चौदा | चौदह | फोर्टीन्थ | 14th ', ' 14 ', text)
        text = re.sub(r' पंदरा | पंद्रह | फिफ्टीन्थ | 15th ', ' 15 ', text)
        text = re.sub(r' सोळा | सिक्सटीन्थ | 16th ', ' 16 ', text)
        text = re.sub(r' सत्रा | सतरा | सेवेंटींथ | 17th ', ' 17 ', text)
        text = re.sub(r' अठरा | एटीन्थ | 18th ', ' 18 ', text)
        text = re.sub(r' एकोणीस | एकोणवीस | नाइनटींथ | 19th ', ' 19 ', text)
        text = re.sub(r' वीस | ट्वंटिएथ | 20th ', ' 20 ', text)
        text = re.sub(r' तीस | थर्टीयेत | 30th ', ' 30 ', text)
        return text

    def convert_telugu_text_to_int(self,text): 
        text = re.sub(r'-', ' - ', text)                                    # To include the Interval days 
        text = re.sub(r' ౨౧ | ఇరవయ్యొక్కటి | ఇరవైఒక్కటిన | ఇరవై ఒకటి | ఇరవై ఒక్కటి | ట్వంటీ వన్ | ఇరవై ఒకటొ | ట్వంటీ ఫస్ట్ | ఇరవై ఒకటి | ఇరవై ఒక్కటవ | 21st | 21 వ | 21 న | 21 కి | 21వ | 21న | 21కి | ఇక్కీస్ | twenty one | twenty first | 21st ', ' 21 ', text)
        text = re.sub(r' ౨౨ | ఇరవై రెండు | ఇరవైరెండున | ఇరవై రెండొవ | ఇరవై రెండొవది | ట్వంటీ టూ | ఇరవై రెండొ | ట్వంటీ సెకెండ్ | ఇరవై రెండో | ఇరవై రెండవ | 22nd | 22 వ | 22 న | 22 కి | 22వ | 22న | 22కి | బాఇస్ | twenty two | twenty second | 22nd ', ' 22 ', text)
        text = re.sub(r' ౨౩ | ఇరవై మూడు | ఇరవైమూడున | ఇరవై మూడవ | ఇరవై మూడొవది | ట్వంటీ త్రి | ట్వంటీ థర్డ్ | ఇరవై మూడొ | ఇరవై మూడో | ఇరవై మూడొవ | 23rd | 23 వ | 23 న | 23 కి | 23వ | 23న | 23కి | తేఇస్ | twenty three | twenty third | 23rd ', ' 23 ', text)
        text = re.sub(r' ౨౪ | ఇరవై నాలుగు | ఇరవైనాల్గున | ఇరవై నాల్గొవ | ఇరవై నాల్గొవది | ట్వంటీ ఫోర్ | ట్వంటీ ఫోర్త్ | ఇరవై నాల్గొ | ఇరవై నాల్గో | ఇరవై నాల్గవ | 24th | 24 వ | 24 న | 24 కి | 24వ | 24న | 24కి | చౌబీస్ | twenty four | twenty fourth | 24th ', ' 24 ', text)
        text = re.sub(r' ౨౫ | ఇరవై ఐదు | ఇరవైఐదున | ఇరవై ఐదొవ | ఇరవై ఐదొవది | ట్వంటీ ఫైవ్ | ట్వంటీ ఫిఫ్త్ | ఇరవై ఐదో | ఇరవై ఐదొ | ఇరవై ఐదవ | 25th | 25 వ | 25 న | 25 కి | 25వ | 25న | 25కి | పచ్చిస్ | twenty five | twenty fifth | 25th ', ' 25 ', text)
        text = re.sub(r' ౨౬ | ఇరవై ఆఱు | ఇరవైఆరున | ఇరవై ఆరు | ఇరవై ఆరొవ | ఇరవై ఆరో | ట్వంటీ సిక్స్ | ట్వంటీ సిక్స్త్ | ఇరవై ఆరొ | ఇరవై ఆరొవది | ఇరవై ఆరవ | 26th | 26 వ | 26 న | 26 కి | 26వ | 26న | 26కి | చబ్బీస్ | twenty six | twenty sixth | 26th ', ' 26 ', text)
        text = re.sub(r' ౨౭ | ఇరవయ్యేడు | ఇరవైఏడున | ఇరవయ్యేడొవ | ఇరవయ్యేడొవది | ఇరవయ్యేడో | ట్వంటీ సెవెన్ | ఇరవయ్యేడొ | ట్వంటీ సెవెంత్ | ఇరవై ఏడు | ఇరవయ్యేడవ | ఇరవై ఏడవ | 27th | 27 వ | 27 న | 27 కి | 27వ | 27న | 27కి | సతఇస్ | twenty seven | twenty seventh | 27th ', ' 27 ', text)
        text = re.sub(r' ౨౮ | ఇరవై ఎనిమిది | ఇరవైఎనిమిదిన | ఇరవై ఎనిమిదొవ | ఇరవై ఎనిమిదిది | ట్వంటీ ఎయిట్ | ఇరవై ఎనిమిదొ | ట్వంటీ ఎయిత్ | ట్వంటీ యైత్ | ట్వంటీ ఎయిడ్త్ | ఇరవై ఎనిమిదో | ఇరవై ఎనిమిదవ | 28th | 28 వ | 28 న | 28 కి | 28వ | 28న | 28కి | అట్టఇస్ | twenty eight | twenty eighth | 28th ', ' 28 ', text)
        text = re.sub(r' ౨౯ | ఇరవై తొమ్మిది | ఇరవైతొమ్మిదిన | ఇరవై తొమ్మిదొవది | ట్వంటీ నైన్ | ట్వంటీ నైన్త్ | ఇరవై తొమ్మిదొ | ఇరవై తొమ్మిదో | ఇరవై తొమ్మిదొవ | ఇరవై తొమ్మిదవ | 29th | 29 వ | 29 న | 29 కి | 29వ | 29న | 29కి | ఉన్తీస్ | twenty nine | twenty ninth | 29th ', ' 29 ', text)
        text = re.sub(r' ౩౧ | ముప్పై ఒక్కటి | ముప్పైఒక్కటిన | ముప్పై ఒకటవ | ముప్పై ఒకటోవది | థర్టీ వన్ | ముప్పై ఒకటొ | థర్టీ ఫస్ట్ | ముప్పై ఒకటో | ముప్పై ఒకటోవ | 31st | 31 వ | 31 న | 31 కి | 31వ | 31న | 31కి | ఇక్తీస్ | thirty one | thirty first | 31st ', ' 31 ', text)
        text = re.sub(r' ౧ | 1 | ఒక్కటి | ఒక్కటిన | ఒంటి | ఒకటొ | ఒకటి | మొదటిది | మొదటి | ఒకటవ | ఒక్కటో | ఒక్కటొ | ఒక్కటవ | వన్ | ఫస్ట్ | ఫస్టు | ఒకటొవది | ఒక్కటొవది | ఒక | ఒక్క | ఒకటో | 1 వ | 1 న | 1 కి | 1వ | 1న | 1కి | ఏక్ | one | first | 1st ', ' 1 ', text)
        text = re.sub(r' ౨ | రెండు | రెండున | రొండు | రెండొవ | రెండో | రెండొ | రెండవ | రెండవది | టూ | టు | సెకెండ్ | రెండొవది | 2nd | 2 వ | 2 న | 2 కి | 2వ | 2న | 2కి | two | second | 2nd', ' 2 ', text)
        text = re.sub(r' ౩ | మూడు | మూడున | మూడోవ | మూడొ | త్రి | థర్డ్ | మూడో | మూడొవది | మూడవ | 3rd | 3 వ | 3 న | 3 కి | 3వ | 3న | 3కి | three | third | 3rd ', ' 3 ', text)
        text = re.sub(r' ౪ | నాలుగు | నాల్గున | నాల్గు | నాల్గొ | నాల్గొవ | నాల్గొవది | నాల్గో | ఫోర్ | ఫోర్త్ | నాలగు | నాల్గవ | 4th | 4 వ | 4 న | 4 కి | 4వ | 4న | 4కి | four | fourth |  4th ', ' 4 ', text)
        text = re.sub(r' ౫ | ఐదు | ఐదున | అయిదు | ఐదింటికి | ఐదొవ | ఫైవ్ | ఫిఫ్త్ | ఐదొ | అయిదవది | ఐదో | ఐదవ | 5th | 5 వ | 5 న | 5 కి | 5వ | 5న | 5కి | five | fifth |  5th ', ' 5 ', text)
        text = re.sub(r' ౬ | ఆరు | ఆరున | ఆఱు | ఆరొవ | ఆరొవది | సిక్స్ | సిక్స్త్ | ఆరొ | ఆరో | ఆరవ | 6th | 6 వ | 6 న | 6 కి | 6వ | 6న | 6కి | చే | six | sixth | 6th ', ' 6 ', text)
        text = re.sub(r' ౭ | ఏడు | ఏడున | ఏడొవ | ఏడొవది | సెవెన్ | సెవెంత్ | ఏడో | ఏడొ | ఏడవ | 7th | 7 వ | 7 న | 7 కి | 7వ | 7న | 7కి | సాత్ | seven | seventh | 7th ', ' 7 ', text)
        text = re.sub(r' ౮ | ఎనిమిది | ఎనిమిదిన | ఎనిమిదొవ | ఎనిమిదిది | ఎయిట్ | యైత్ | ఎనిమిదొ | ఎనిమిదో | ఎనిమిధవ | 8th | 8 వ | 8 న | 8 కి | 8వ | 8న | 8కి | ఆట్ | eight | eighth | 8th ', ' 8 ', text)
        text = re.sub(r' ౯ | తొమ్మిది | తొమ్మిదిన | తొమ్మిదిది | నైన్ | నైన్త్ | తొమ్మిదో | తొమ్మిదోవ | తొమ్మిదొ | తొమ్మిదవ | తొమ్మిదింటి | 9th | 9 వ | 9 న | 9 కి | 9వ | 9న | 9కి | నౌ | నవ్ | nine | ninth | 9th ', ' 9 ', text)
        text = re.sub(r' ౧౦ | పది | పదిన | పదొవ | పదొవది | టెన్ | టెన్త్ | పదో | పదొ | పదవ | పదింటి | 10th | 10 వ | 10 న | 10 కి | 10వ | 10న | 10కి | దస్ | ten | tenth | 10th ', ' 10 ', text)
        text = re.sub(r' ౧౧ | పదకొండు | పదకొండున | పదకొండొవ | పదకొండొవది | ఎలెవన్ | పదకొండొ | లెవన్ | ఎలెవెన్త్ | లెవెన్త్ | పదకొండో | పదకొండవ | 11th | 11 వ | 11 న | 11 కి | 11వ | 11న | 11కి | గ్యారహ్ | eleven | eleventh | 11th ', ' 11 ', text)
        text = re.sub(r' ౧౨ | పన్నెండు | పన్నెండున | పన్నెండవ | పన్నెండవది | పన్నెండో | పన్నెండొవ | పన్నెండొవది | ట్వెల్వ్ | ట్వెల్వ్త్ | ట్వెల్త్ | పన్నెండొ | 12th | 12 వ | 12 న | 12 కి | 12వ | 12న | 12కి | బారహ్ | twelve | twelfth | 12th ', ' 12 ', text)
        text = re.sub(r' ౧౩ | పదమూడు | పదమూడున | పదమూడొవ | పదముండొవది | థర్టీన్ | పదమూడొ | పదమూడో | థర్టీన్త్ | పదముండొ | పదమూడవ | 13th | 13 వ | 13 న | 13 కి | 13వ | 13న | 13కి | తెరహ్ | thirteen | thirteenth | 13th ', ' 13 ', text)
        text = re.sub(r' ౧౪ | పద్నాలుగు | పద్నాలుగున | పద్నలుగొవ | పద్నాలుగుది | ఫోర్టీన్ | పద్నలుగొ | ఫోర్టుఈంత | ఫోర్టీన్త్ | పద్నాలుగో | పద్నలుగవ | 14th | 14 వ | 14 న | 14 కి | 14వ | 14న | 14కి | చౌదహ్ | చౌద | fourteen | fourteenth | 14th ', ' 14 ', text)
        text = re.sub(r' ౧౫ | పదిహేను | పదిహేనున | పదిహేనోవ | పదిహేనోవాది | పదిహేనొ | పదిహేనో | ఫిఫ్టీన్ | ఫిఫ్టీన్త్ | పదైదు | పదిహేనవ | 15th | 15 వ | 15 న | 15 కి | 15వ | 15న | 15కి | పంద్రాహ్ | పంద్రా | fifteen | fifteenth | 15th ', ' 15 ', text)
        text = re.sub(r' ౧౬ | పదహారు | పదహారున | పదహారోది | సిక్స్టీన్ | సిక్స్టీన్త్ | పదహారొ | పదహారో | పదహారోవ | పదహారవ | 16th | 16 వ | 16 న | 16 కి | 16వ | 16న | 16కి | సోలహ్ | సోల | sixteen | sixteenth | 16th ', ' 16 ', text)
        text = re.sub(r' ౧౭ | పదిహేడు | పదిహేడున | పదిహేడొవ | పదిహేడొవాది | పదిహేడో | సెవెంటీన్ | సెవెంటీన్త్ | పదిహేడొ | పదిహేడవ | 17th | 17 వ | 17 న | 17 కి | 17వ | 17న | 17కి | సత్ర | సత్రహ్ | seventeen | seventeenth | 17th ', ' 17 ', text)
        text = re.sub(r' ౧౮ | పద్దెనిమిది | పద్ధెనిమిదిన | పద్దెనిమిదొవ | పద్దెనిమిదిది | పద్దెనిమిదో | పద్దెనిమిదొ | యయిటీన్ | యయిటీన్త్ | పద్దెనిమిదవ | 18th | 18 వ | 18 న | 18 కి | 18వ | 18న | 18కి | అటారాహ్ | అటారా | eighteen | eighteenth | 18th ', ' 18 ', text)
        text = re.sub(r' ౧౯ | పంతొమ్మిది | పందొమ్మిదిన | పందొమ్మిదొవ | పంతొమ్మిదో | పంతొమ్మిదొవ | నైంటీన్ | పందొమ్మిదొ | నైంటీన్త్ | పందొమ్మిది | పందొమ్మిదవ | 19th | 19 వ | 19 న | 19 కి | 19వ | 19న | 19కి | ఉన్నీస్ | nineteen | nineteenth | 19th ', ' 19 ', text)
        text = re.sub(r' ౨౦ | ఇరవై | ఇరవైన | ఇరవై | ఇరవయ్యోవది | ట్వంటీ | ట్వంటీత్ | ఇరవైవ | ట్వంటియత్ | ఇరవయ్యో | ఇరవయవ | ఇరవయోవ | 20th | 20 వ | 20 న | 20 కి | 20వ | 20న | 20కి | బీస్ | twenty | twentieth | 20th ', ' 20 ', text)
        text = re.sub(r' ౩౦ | ముప్పై | ముప్ఫైన | ముప్పైయొవది | థర్టీ | థర్టీత్ | థర్టియాత్ | ముప్పైయొవ | ముప్పైయో | ముప్పైవ | ముప్పైయవ | 30th | 30 న | 30 కి | 30వ | 30న | 30కి | తీస్ | thirty | thirtieth | 30th ', ' 30 ', text)
        return text



    def convert_malayalam_text_to_int(self,text):
        text = re.sub(r'-', ' - ', text)                                    # To include the Interval days 
        text = re.sub(r' ഇരുപത്തിഒന്ന് | ഇരുപത്തിഒന്നു | ഇരുപത്തിഒന്നാം | ഇരുപത്തിയൊന്ന് | ഇരുപത്തിയൊന്നു | ഇരുപത്തിയൊന്നാം | ട്വന്റി ഫസ്റ്റ് | ട്വന്റി ഒൺ | 21-ാം | 21ആം | 21st | 21 ആം | 21 ന് | 21ന് ', ' 21 ', text)
        text = re.sub(r' ഇരുപത്തിരണ്ട് | ഇരുപത്തിരണ്ടു | ഇരുപത്തിരണ്ടാം | ഇരുപത്തിരണ്ടാമത് | ഇരുപത്തിരണ്ടാമത്തേത് | ട്വന്റി സെക്കന്റ് | ട്വന്റി ടു | 22-ാം | 22ആം | 22nd | 22 ആം | 22 ന് | 22ന് ', ' 22 ', text)
        text = re.sub(r' ഇരുപത്തിമൂന്ന് | ഇരുപത്തിമൂന്നു | ഇരുപത്തിമൂന്നാം | ഇരുപത്തിമൂന്നാമത് | ഇരുപത്തിമൂന്നാമത്തേത് | ഇരുപത്തി മൂന്ന് | ട്വന്റി തേർഡ് | ട്വന്റി ത്രീ | 23-ാം | 23ആം | 23rd | 23 ആം | 23 ന് | 23ന് ', ' 23 ', text)
        text = re.sub(r' ഇരുപത്തിനാല് | ഇരുപത്തിനാലു | ഇരുപത്തിനാലാം | ഇരുപതിനാലാമത് | ഇരുപതിനാലാമത്തെ | ട്വന്റി ഫൗർത്ത | ട്വന്റി ഫൗര് | 24-ാം | 24ആം | 24th | 24 ആം | 24 ന് | 24ന് ', ' 24 ', text)
        text = re.sub(r' ഇരുപത്തിഅഞ്ചു | ഇരുപത്തിആറു | ഇരുപത്തിയഞ്ചാം | ഇരുപത്തിഅഞ്ചാമത്തെ | ഇരുപത്തിയഞ്ചു | ഇരുപത്തിഅഞ് | ഇരുപത്തിയഞ്ച് | ട്വന്റി ഫിഫ്ത് | ട്വന്റി ഫൈവ് | 25-ാം | 25ആം | 25th | 25 ആം | 25 ന് | 25ന് ', ' 25 ', text)
        text = re.sub(r' ഇരുപത്തിആറ് | ഇരുപത്തിയാറു | ഇരുപത്തിയാറാം | ഇരുപത്തിആറാമത്തെ | ഇരുപത്തി ആറ് | ട്വന്റി സിസ്ത് | ട്വന്റി സിക്സ് | 26-ാം | 26ആം | 26th | 26 ആം | 26 ന് | 26ന് ', ' 26 ', text)
        text = re.sub(r' ഇരുപത്തിഏഴ് | ഇരുപത്തിഏഴു | ഇരുപത്തിയേഴാം | ഇരുപത്തിഏഴാമത്തെ | ഇരുപത്തി ഏഴ് | ഇരുപത്തിയേഴു | ട്വന്റി സെവൻത് | ട്വന്റി സെവൻ | 27-ാം | 27ആം | 27th | 27 ആം | 27 ന് | 27ന് ', ' 27 ', text)
        text = re.sub(r' ഇരുപത്തിയെട്ടു | ഇരുപത്തിഎട്ടു | ഇരുപത്തിയെട്ടാം | ഇരുപത്തി എട്ടു | ഇരുപത്തിയെട്ട് | ഇരുപത്തിയെട്ടാമത്തെ | ട്വന്റി ഈഘത് | ട്വന്റി ഈഘട് | 28-ാം | 28ആം | 28th | 28 ആം | 28 ന് | 28ന് ', ' 28 ', text)
        text = re.sub(r' ഇരുപത്തിഒന്‍പത് | ഇരുപത്തിഒന്പതു | ഇരുപത്തിഒന്പതാമത്തെ | ഇരുപത്തിഒന്പതാം | ഇരുപത്തി ഒന്പത് | ട്വന്റി നയനത് | ട്വന്റി നയൻ | 29-ാം | 29ആം | 29th | 29 ആം | 29 ന് | 29ന് ', ' 29 ', text)
        text = re.sub(r' മുപ്പത്തിയൊന് | മുപ്പത്തിയൊന്നാമത്തെ | മുപ്പത്തിയൊന്നാം | മുപ്പത്തി ഒന്ന് | മുപ്പത്തിയൊന്നു | തേർട്ടി ഫസ്റ്റ് | തേർട്ടി ഒൺ | 31-ാം | 31ആം | 31st | 31 ആം | 31 ന് | 31ന് ', ' 31 ', text)
        text = re.sub(r' ഒന്ന് | ആദ്യം | ഒന്നു | ഒരു | ഫസ്റ്റ് | ഒന്നാം | വൺ | 1-ാം | 1ആം | 1st | 1 ആം | 1 ന് | 1ന് ', ' 1 ', text)
        text = re.sub(r' രണ്ട് | രണ്ടു | രണ്ടാമത്തേത് | രണ്ടാം | സെക്കന്റ് | ടു | 2-ാം | 2ആം | 2nd | 2 ആം | 2 ന് | 2ന് ', ' 2 ', text)
        text = re.sub(r' മൂന്ന് | മൂന്നു | മൂന്നാം | മൂന്നാമത്തേത് | മൂന്നാമത് | തേർഡ് | ത്രീ | 3-ാം | 3ആം | 3rd | 3 ആം | 3 ന് | 3ന് ', ' 3 ', text)
        text = re.sub(r' നാല് | നാലു | നാലാം | നാലാമത്തെ | ഫൗർത്ത | ഫൗർ | 4-ാം | 4ആം | 4th | 4 ആം | 4 ന് | 4ന് ', ' 4 ', text)
        text = re.sub(r' അഞ്ച് | അഞ്ചു | അഞ്ചാം | അഞ്ചാമത്തെ | ഫൈവ് | ഫിഫ്ത് | 5-ാം | 5ആം | 5th | 5 ആം | 5 ന് | 5ന് ', ' 5 ', text)
        text = re.sub(r' ആറ് | ആറു | ആറാം | ആറാമത്തെ | സിക്സ് | സിസ്ത് | 6-ാം | 6ആം | 6th | 6 ആം | 6 ന് | 6ന് ', ' 6 ', text)
        text = re.sub(r' ഏഴ് | ഏഴാം | ഏഴു | ഏഴാമത് | ഏഴാമത്തേത് | സെവൻ | സെവൻത് | 7-ാം | 7ആം | 7th | 7 ആം | 7 ന് | 7ന് ', ' 7 ', text)
        text = re.sub(r' എട്ട് | എട്ടാം | എട്ടു | എട്ടാമത് | എട്ടാമത്തേത് | എയ്ത് | എയ്‌ഗ്ത് | 8-ാം | 8ആം | 8th | 8 ആം | 8 ന് | 8ന് ', ' 8 ', text)
        text = re.sub(r' ഒമ്പത് | ഒമ്പതാം | ഒൻപതു | ഒമ്പതു | ഒമ്പതാമത്തേത് | നയൻ | നയനത് | 9-ാം | 9ആം | 9th | 9 ആം | 9 ന് | 9ന് ', ' 9 ', text)
        text = re.sub(r' പത്ത് | പത്താം | പത്തു | പത്താമത്തെ | ടെൻ | ടെൻത് | 10-ാം | 10ആം | 10th | 10 ആം | 10 ന് | 10ന് ', ' 10 ', text)
        text = re.sub(r' പതിനൊന്ന് | പതിനൊന്നു | പതിനൊന്നാം | പതിനൊന്നാമത്തെ | പതിനൊന്നാമത്തേത് | ലവൻ | എലവെന്നത് | 11-ാം | 11ആം | 11th | 11 ആം | 11 ന് | 11ന് ', ' 11 ', text)
        text = re.sub(r' പന്ത്രണ്ട് | പന്ത്രണ്ടാം | പന്ത്രണ്ടു | പന്ത്രണ്ടാമത്തെ | പന്ത്രണ്ടാമത്തേത് | ട്വൽത് | ട്വൽവ് | 12-ാം | 12ആം | 12th | 12 ആം | 12 ന് | 12ന് ', ' 12 ', text)
        text = re.sub(r' പതിമൂന്ന് | പതിമൂന്നാം | പതിമൂന്നു | പതിമൂന്നാമത് | പതിമൂന്നാമത്തെ | തെർറ്റീൻത് | തിർടീന് | 13-ാം | 13ആം | 13th | 13 ആം | 13 ന് | 13ന് ', ' 13 ', text)
        text = re.sub(r' പതിനാല് | പതിനാലാം | പതിനാലാമത്ത | പതിനാലു | പതിനാലാമത് | ഫൗർറ്റീൻത് | ഫൗർറ്റീൻ | 14-ാം | 14ആം | 14th | 14 ആം | 14 ന് | 14ന് ', ' 14 ', text)
        text = re.sub(r' പതിനഞ്ച് | പതിനഞ്ചാം | പതിനഞ്ചു | പതിനഞ്ചാമത്തെ | പതിനഞ്ചാമത് | ഫിഫ്റ്റീൻത് | ഫിഫ്റ്റീൻ | 15-ാം | 15ആം | 15th | 15 ആം | 15 ന് | 15ന് ', ' 15 ', text)
        text = re.sub(r' പതിനാറ് | പതിനാറാം | പതിനാറു | പതിനാറാമത്തെ | പതിനാറാമത് | സിസ്റ്റീൻത് | സിസ്റ്റീൻ | 16-ാം | 16ആം | 16th | 16 ആം | 16 ന് | 16ന് ', ' 16 ', text)
        text = re.sub(r' പതിനേഴ് | പതിനേഴു | പതിനേഴാമത്തെ | പതിനേഴ് | പതിനേഴാം | സെവന്റീന്ത് | സെവന്റീൻ | 17-ാം | 17ആം | 17th | 17 ആം | 17 ന് | 17ന് ', ' 17 ', text)
        text = re.sub(r' പതിനെട്ട് | പതിനെട്ടാം | പതിനെട്ടാമത് | പതിനെട്ടാമത്തെ | പതിനെട്ടു | ഈഘറ്റീൻത് | ഈഘറ്റീൻ | 18-ാം | 18ആം | 18th | 18 ആം | 18 ന് | 18ന് ', ' 18 ', text)
        text = re.sub(r' പത്തൊമ്പതു | പത്തൊമ്പതാം | പത്തൊമ്പതാമത്തെ | പത്തൊമ്പത് | നിനെറ്റീൻത് | നിനെറ്റീൻ | 19-ാം | 19ആം | 19th | 19 ആം | 19 ന് | 19ന് ', ' 19 ', text)
        text = re.sub(r' ഇരുപത് | ഇരുപതു | ഇരുപതാം | ഇരുപതാമത്തെ  | ട്വൻറിയത് | ട്വന്റി | 20-ാം | 20ആം | 20th | 20 ആം | 20 ന് | 20ന് ', ' 20 ', text)
        text = re.sub(r' മുപ്പതാം | മുപ്പതു | മുപ്പതാമത്തെ | മുപ്പത് | തേർട്ടിയത് | തെർറ്റീത് | തേർട്ടി | 30-ാം | 30ആം | 30th | 30 ആം | 30 ന് | 30ന് ', ' 30 ', text)
        return text

    def convert_tamil_text_to_int(self,text):
        text = re.sub(r'-', ' - ', text)                                    # To include the Interval days 
        text = re.sub(r' இருபத்தொன்னு | இருபத்தி ஒன்னு | இருபத்தி ஒன்று | இருபத்து ஒன்னு | இருபத்து ஒன்று | இருபத்தொண்ணாம் | இருவத்தொன்னு | இருபத்தொன்னு | டுவென்டி ஒன் | டுவென்டி ஃபர்ஸ்ட் | 21st ', ' 21 ', text)
        text = re.sub(r' இருபத்து இரண்டு | இருபத்தி இரண்டு | இருபத்துரண்டு | இருபத்திரண்டு | இருபத்திரண்டாம் | இருவத்துரண்டு | இருபத்துரண்டு | டுவென்டி டூ | டுவென்டி செகண்ட் | 22nd ', ' 22 ', text)
        text = re.sub(r' இருபத்து மூன்று | இருபத்தி மூன்று | இருபத்து மூனு | இருபத்தி மூனு | இருபத்தி மூணாம் | இருவத்து மூனு | இருபத்து மூனு | டுவென்டி த்ரீ | டுவென்டி தேர்ட் | 23rd ', ' 23 ', text)
        text = re.sub(r' இருபத்து நான்கு | இருபத்தி நான்கு | இருபத்து நாலு | இருபத்தி நாலு | இருபத்திநாலாம் | இருபத்தினான்காம் | இருவத்துநாலு | இருவத்தி நாலு | டுவென்டி ஃபோர் | டுவென்டி ஃபோர்த் | 24th ', ' 24 ', text)
        text = re.sub(r' இருபத்தைந்து | இருபத்தி ஐந்து | இருபத்து ஐந்து | இருபத்தைந்தாம் | இருபத்தஞ்சாம் | இருவத்தஞ்சு | இருபத்தஞ்சு | டுவென்டி ஃபைவ் | டுவென்டி ஃபிஃப்த் | 25th ', ' 25 ', text)
        text = re.sub(r' இருபத்தாறு | இருபத்தி ஆறு | இருபத்து ஆறு | இருபத்தியாரு | இருவத்தாராம் | இருபத்தாராம் | இருவத்தாறு | இருவத்தி ஆறு | டுவென்டி சிக்ஸ் | டுவென்டி சிக்ஸ்த் | 26th ', ' 26 ', text)
        text = re.sub(r' இருபத்தேழு | இருபத்தி ஏழு | இருபத்தி ஏழாம் | இருபத்து ஏழு | இருபத்தேழாம் | இருவத்தேழு | இருவத்தி ஏழு | டுவென்டி செவன் | டுவென்டி செவென்த் | 27th ', ' 27 ', text)
        text = re.sub(r' இருபத்தி எட்டாம் | இருபத்தெட்டு | இருபத்தி எட்டு | இருபத்து எட்டு | இருபத்தெட்டாம் | இருவத்தெட்டு | இருவத்தி எட்டு | டுவென்டி எய்ட் | டுவென்டி எய்ட்த் | 28th ', ' 28 ', text)
        text = re.sub(r' இருபத்தொன்பது | இருபத்தொம்பது | இருபத்து ஒன்பது | இருபத்தி ஒன்பது | இருபத்து ஒம்பது | இருபத்தி ஒம்பது | இருபத்தொன்பதாம் | இருபத்தொம்பதாம் | இருவத்தொம்போது | இருபத்தொம்போது | இருவத்தி ஒம்போது | டுவென்டி நைன் | டுவென்டி நைன்த் | 29th ', ' 29 ', text)
        text = re.sub(r' முப்பத்தொன்று | முப்பத்து ஒன்று | முப்பத்தி ஒன்று | முப்பத்து ஒன்னு | முப்பத்தி ஒன்னு | முப்பத்தியொன்னு | முப்பத்தியொன்று | முப்பத்தியொன்றாம் | முப்பத்தொன்றாம் | முப்பத்தி ஒண்ணாம் | முப்பத்தி ஒன்னாம் | தேர்டி ஒன் | தேர்டி ஃபர்ஸ்ட் | தெர்ட்டி ஒன் | தெர்ட்டி ஃபர்ஸ்ட் | தர்ட்டி ஒன் | தர்ட்டி ஃபர்ஸ்ட் | முப்பத்தி ஒன் | 31st ', ' 31 ', text)
        text = re.sub(r' ஒரு | ஒன்றாம் | ஒன்னு | ஒன்று | ஒண்ணாம் | ஒன்னாம் | ஒன் | ஃபர்ஸ்ட் | 1st ', ' 1 ', text)
        text = re.sub(r' இரண்டு | ரண்டு | இரண்டாம் | ரெண்டு | டூ | செகண்ட் | 2nd ', ' 2 ', text)
        text = re.sub(r' மூனு | மூன்று | மூணாம் | மூணு | மூனாம் | த்ரீ | தேர்ட் | 3rd ', ' 3 ', text)
        text = re.sub(r' நாலு | நான்கு | நாலாம் | ஃபோர் | ஃபோர்த் | 4th ', ' 4 ', text)
        text = re.sub(r' அஞ்சு | ஐந்து | ஐந்தாம் | அஞ்சாம் | ஃபைவ் | ஃபிஃப்த் | 5th ', ' 5 ', text)
        text = re.sub(r' ஆறு | ஆறாம் | சிக்ஸ் | சிக்ஸ்த் | 6th ', ' 6 ', text)
        text = re.sub(r' ஏழு | ஏழாம் | செவன் | செவன்த் | செவென்த் | 7th ', ' 7 ', text)
        text = re.sub(r' எட்டு | எட்டாம் | எய்ட் | எய்ட்த் | 8th ', ' 8 ', text)
        text = re.sub(r' ஒன்பது | ஒன்போது | ஒன்பதாம் | ஒம்போது | நைன் | நைன்த் | 9th ', ' 9 ', text)
        text = re.sub(r' பத்து | பத்தாம் | தென் | டென்த் | டென் | 10th ', ' 10 ', text)
        text = re.sub(r' பதினொன்னு | பதினொன்று | பதினொன்னாம் | இலவன் | லவன்த் | லெவன்த் | 11th ', ' 11 ', text)
        text = re.sub(r' பன்னிரண்டு | பன்னன்டு | பன்னன்டாம் | பன்னிரண்டாம் | ட்வெல்வ் | டுவெல்த் | 12th ', ' 12 ', text)
        text = re.sub(r' பதிமூன்று | பதின் மூன்று | பதிமூணாம் | தர்டீன் | தர்டீன்த் | தெர்டீன் | தெர்டீன்த் | 13th ', ' 13 ', text)
        text = re.sub(r' பதினாலு | பதினான்கு | பதிநாலாம் | ஃபோர்டீன் | ஃபோர்டீன்த் | 14th ', ' 14 ', text)
        text = re.sub(r' பதினைந்து | பாஞ்சு | பதினைந்தாம் | பாஞ்சாம் | பதினஞ்சாம் | ஃபிஃப்டீன் | பிஃப்டீன்த் | 15th ', ' 15 ', text)
        text = re.sub(r' பதினாறு | பதின்ஆறு | பதினாறாம் | சிக்ஸ்டீன் | சிக்ஸ்டீன்த் | 16th ', ' 16 ', text)
        text = re.sub(r' பதினேழு | பதின்ஏழு | பதினேழாம் | செவன்டீன் | செவன்டீன்த் | 17th ', ' 17 ', text)
        text = re.sub(r' பதினெட்டு | பதின்எட்டு | பதினெட்டாம் | எய்ட்டீன் | எய்ட்டீன்த் | 18th ', ' 18 ', text)
        text = re.sub(r' பத்தொன்பது | பத்தொம்பது | பதின்ஒன்பது | பதினொன்பதாம் | பத்தொம்போது | நைன்டீன் | நைன்டீன்த் | 19th ', ' 19 ', text)
        text = re.sub(r' இருபது | இருபதாம் | இருவது | இருவதாம் | டுவென்டி | 20th ', ' 20 ', text)
        text = re.sub(r' முப்பதாம் | முப்பது | தேர்டி | தேர்ட்டி | தெர்ட்டி | தர்ட்டி | 30th ', ' 30 ', text)
        return text

    def convert_kannada_text_to_int(self,text):
        text = re.sub(r'-', ' - ', text)                                    # To include the Interval days 
        text = re.sub(r' ೨೧ | ಇಪ್ಪತ್ತೊಂದು | ಇಪ್ಪತ್ತೊಂದನೆಯ | ಇಪ್ಪತ್ತೊಂದರ | ಟ್ವೆಂಟಿ ಒನ್ | ಟ್ವೆಂಟಿ ಫಸ್ಟ್ | ಇಪ್ಪತ್ತೊಂದ್ | 21ನೇ | 21 ರ | 21ರ | 21 ರೊಳಗೆ | 21 ರಂದು | 21ಕ್ಕೆ | 21st ', ' 21 ', text)
        text = re.sub(r' ೨೨ | ಇಪ್ಪತ್ತೆರಡು | ಇಪ್ಪತ್ತೆರಡನೇಯ | ಇಪ್ಪತ್ತೆರಡರ | ಟ್ವೆಂಟಿ ಟೂ | ಟ್ವೆಂಟಿ ಸೆಕೆಂಡ್ | ಇಪ್ಪತ್ತೆರ್ಡ್ | ಇಪ್ಪತ್ತೆರಡನೆಯ | 22 ರ | 22ರ | 22 ರೊಳಗೆ | 22 ರಂದು | 22ನೇ | 22ಕ್ಕೆ | 22nd ', ' 22 ', text)
        text = re.sub(r' ೨೩ | ಇಪ್ಪತ್ಮೂರು | ಇಪ್ಪತ್ಮೂರನೆಯ | ಇಪ್ಪತ್ಮೂರರ | ಟ್ವೆಂಟಿ ಥ್ರೀ | ಟ್ವೆಂಟಿ ಥರ್ಡ್ | ಇಪ್ಪತ್ತಮೂರ್ | ಇಪ್ಪತ್ತಮೂರನೇ | 23 ರ | 23ರ | 23 ರೊಳಗೆ | 23 ರಂದು | 23ನೇ | 23ಕ್ಕೆ | 23rd ', ' 23 ', text)
        text = re.sub(r' ೨೪ | ಇಪ್ಪತ್ನಾಲ್ಕು | ಇಪ್ಪತ್ನಾಲ್ಕನೆಯ | ಇಪ್ಪತ್ನಾಲ್ಕರ | ಟ್ವೆಂಟಿ ಫೋರ್ | ಟ್ವೆಂಟಿ ಫೋರ್ಥ್ | ಇಪ್ಪತ್ತ್ನಾಲ್ಕ್ | 24 ರ | 24ರ | 24 ರೊಳಗೆ | 24 ರಂದು | 24ನೇ | 24ಕ್ಕೆ | 24th ', ' 24 ', text)
        text = re.sub(r' ೨೫ | ಇಪ್ಪತ್ತೈದು | ಇಪ್ಪತ್ತೈದನೆಯ | ಇಪ್ಪತ್ತೈದರ | ಟ್ವೆಂಟಿ ಫೈವ್ | ಟ್ವೆಂಟಿ ಫಿಫ್ತ್ | ಇಪ್ಪತ್ತೈದ್ | ಇಪ್ಪತ್ತೈದಕ್ಕೆ | 25 ರ | 25ರ | 25 ರೊಳಗೆ | 25 ರಂದು | 25ನೇ | 25ಕ್ಕೆ | 25th ', ' 25 ', text)
        text = re.sub(r' ೨೬ | ಇಪ್ಪತ್ತಾರು| ಇಪ್ಪತ್ತಾರನೆಯ | ಇಪ್ಪತ್ತಾರರ | ಟ್ವೆಂಟಿ ಸಿಕ್ಸ್ | ಟ್ವೆಂಟಿ ಸಿಕ್ಸ್ತ್ | ಇಪ್ಪತ್ತಾರ | 26 ರ | 26ರ | 26 ರೊಳಗೆ | 26 ರಂದು | 26ನೇ | 26ಕ್ಕೆ | 26th ', ' 26 ', text)
        text = re.sub(r' ೨೭ | ಇಪ್ಪತ್ತೇಳು | ಇಪ್ಪತ್ತೇಳನೆಯ | ಇಪ್ಪತ್ತೇಳರ | ಟ್ವೆಂಟಿ ಸೆವೆನ್ | ಟ್ವೆಂಟಿ ಸೆವೆನ್ತ್ | ಇಪ್ಪತ್ತೆಳ್ | 27 ರ | 27ರ | 27 ರೊಳಗೆ | 27 ರಂದು | 27ನೇ | 27ಕ್ಕೆ | 27th ', ' 27 ', text)
        text = re.sub(r' ೨೮ | ಇಪ್ಪತ್ತೆಂಟು | ಇಪ್ಪತೆಂಟನೆಯ | ಇಪ್ಪತ್ತೆಂಟರ | ಟ್ವೆಂಟಿ ಏಟ್ | ಟ್ವೆಂಟಿ ಏಟ್ತ್ | ಇಪ್ಪತ್ತೆಂಟ್ | 28ನೇ | 28ಕ್ಕೆ | ಇಪ್ಪತ್ತೆಂಟನೇ | 28 ರ | 28ರ | 28 ರೊಳಗೆ | 28 ರಂದು | 28th ', ' 28 ', text)
        text = re.sub(r' ೨೯ | ಇಪ್ಪತ್ತೊಂಬತ್ತು | ಇಪ್ಪತ್ತೊಂಬತ್ತನೆಯ | ಇಪ್ಪತ್ತೊಂಬತ್ತರ| ಟ್ವೆಂಟಿ ನೈನ್ | ಟ್ವೆಂಟಿ ನೈನ್ತ್ | ಇಪ್ಪತ್ತೊಂಬತ್ | 29ನೇ | 29ಕ್ಕೆ | 29 ರ | 29ರ | 29 ರೊಳಗೆ | 29 ರಂದು | 29th ', ' 29 ', text)
        text = re.sub(r' ೩೧ | ಮೂವತ್ತೊಂದು | ಮೂವತ್ತೊಂದನೆಯ | ಮೂವತ್ತೊಂದರ | ಥರ್ಟಿ ಒನ್ | ಥರ್ಟಿ ಫಸ್ಟ್ | ಮೌವತ್ತೊಂದ್ | 31ನೇ | 31ಕ್ಕೆ | 31 ರ | 31ರ | 31 ರೊಳಗೆ | 31 ರಂದು | 31st ', ' 31 ', text)
        text = re.sub(r' ೧ | ಒಂದು | ಒಂದನೆ | ಒಂದನೆಯ | ಒನ್ | ವಂದನೇ | ವಂದನೆ | ಫಸ್ಟ್ | ಒಂದ್ | ವನ್ | ಒಂದನೇ | ಒನ್ನೆ | 1ನೇ | 1ಕ್ಕೆ | 1 ರ | 1ರ | 1 ರೊಳಗೆ | 1 ರಂದು | ಒಂದೆರಡು | 1st ', ' 1 ', text)
        text = re.sub(r' ೨ | ಎರಡು | ಎರಡನೆ | ಎರಡನೆಯ | ಟೂ | ಸೆಕೆಂಡ್ | ಎರಡ್ | ಎರಡನೇ | ಟು | 2ನೇ | 2 ರ | 2ರ | 2 ರೊಳಗೆ | 2 ರಂದು | 2ಕ್ಕೆ | ಇನ್ನೆರಡು | ಎರಡ್ಮೂರು | ಇನ್ನೊಂದೆರಡು | 2nd ', ' 2 ', text)
        text = re.sub(r' ೩ | ಮೂರು | ಮೂರನೆ | ಮೂರನೆಯ | ಮೂರನೇ | ಮೂರ್ನೇ | ಥ್ರೀ | ಥರ್ಡ್ | ಮೂರ್ | ತ್ರೀ | ತರ್ಡ್ | 3ನೇ | 3ಕ್ಕೆ | 3 ರ | 3ರ | 3 ರೊಳಗೆ | 3 ರಂದು | ಇನೊಂದ್ಮೂರು | ಇಂಮೂರ್ | ಮೂರೂ | ಮುರು | 3rd ', ' 3 ', text)
        text = re.sub(r' ೪ | ನಾಲ್ಕು | ನಾಲ್ಕನೆ | ನಾಲ್ಕನೇ | ನಾಲ್ಕನೆಯ | ಫೋರ್ | ಫೋರ್ಥ್ | ನಾಲಕ್ | 4ನೇ | 4ಕ್ಕೆ | 4 ರ | 4ರ | 4 ರೊಳಗೆ | 4 ರಂದು | ನಾಲ್ಕೈದು | ಇನೊಂದ್ನಾಲ್ಕು | ಇಂನಾಲ್ಕು | 4th ', ' 4 ', text)
        text = re.sub(r' ೫ | ಐದು | ಐದನೆ | ಐದನೆಯ | ಫೈವ್ | ಫಿಫ್ತ್ | ಐದ್ | ಐದನೇ | 5ನೇ | 5ಕ್ಕೆ | 5ರ | 5 ರ | 5 ರೊಳಗೆ | 5 ರಂದು | ಐದಾರು | ಇನೈದು | 5th ', ' 5 ', text)
        text = re.sub(r' ೬ | ಆರು | ಆರನೆ | ಆರನೆಯ | ಆರಕ್ಕೆ | ಆರನೇ | ಸಿಕ್ಸ್ | ಸಿಕ್ಸ್ತ್ | ಆರ್ | 6ನೇ | 6ಕ್ಕೆ | 6 ರ | 6ರ | 6 ರೊಳಗೆ | 6 ರಂದು | ಆರೇಳು | ಇನ್ನಾರು | 6th ', ' 6 ', text)
        text = re.sub(r' ೭ | ಏಳು | ಏಳನೆ | ಏಳನೆಯ | ಸೆವೆನ್ | ಸೆವೆನ್ತ್ | ಏಳ್ | ಸೆವೆಂತ್ | ಏಳನೇ | 7ನೇ | 7ಕ್ಕೆ | 7 ರ | 7ರ | 7 ರೊಳಗೆ | 7 ರಂದು | ಏಳೆಂಟು | 7th ', ' 7 ', text)
        text = re.sub(r' ೮ | ಎಂಟು | ಎಂಟನೆ | ಎಂಟನೆಯ | ಏಟ್ | ಎಡ್ತ್ | ಎಂಟ್ | ಎಂಟನೇ | 8ನೇ | 8ಕ್ಕೆ | 8 ರ | 8ರ | 8 ರೊಳಗೆ | 8 ರಂದು | 8th ', ' 8 ', text)
        text = re.sub(r' ೯ | ಒಂಬತ್ತು | ಒಂಬತ್ತನೆ | ಒಂಬತ್ತನೆಯ | ನೈನ್ | ನೈನ್ಥ್ | ಒಂಬತ್ | ಒಂಬತ್ತನೇ | 9ನೇ | 9ಕ್ಕೆ | 9 ರ | 9ರ | 9 ರಂದು |9 ರೊಳಗೆ | 9ರೊಳಗೆ | 9th ', ' 9 ', text)
        text = re.sub(r' ೧೦ | ಹತ್ತು | ಹತ್ತನೆ | ಹತ್ತನೆಯ | ಟೆನ್ | ಟೆಂತ್ | ಹತ್ | ಹತ್ತನೇ | 10ನೇ | 10ಕ್ಕೆ | 10 ರ | 10ರ | 10 ರೊಳಗೆ | 10 ರಂದು | ಇನೊಂದ್ಹತ್ತು | 10th ', ' 10 ', text)
        text = re.sub(r' ೧೧ | ಹನ್ನೊಂದು | ಹನ್ನೊಂದನೆ | ಹನ್ನೊಂದನೆಯ | ಲೆವೆನ್ | ಲೆವೆನ್ತ್ | ಹನೊಂದ್ | ಇಲೆವೆನ್ | ಇಲೆವೆನ್ತ್ | ಹನೊಂದನೇ | 11ನೇ | 11 ರ | 11ರ | 11 ರೊಳಗೆ | 11 ರಂದು | 11ಕ್ಕೆ | 11th ', ' 11 ', text)
        text = re.sub(r' ೧೨ | ಹನ್ನೆರಡು | ಹನ್ನೆರಡನೆ | ಹನ್ನೆರಡನೆಯ | ಟವೆಲ್ವೆ | ಟವೆಲ್ವೆತ್ | ಹಣೆರ್ಡ್ | ಹನ್ನೆರಡನೇ | 12ನೇ |2ಕ್ಕೆ | 12 ರ | 12ರ | 12 ರೊಳಗೆ | 12 ರಂದು | 12ಕ್ಕೆ | 12th ', ' 12 ', text)
        text = re.sub(r' ೧೩ | ಹದಿಮೂರು | ಹದಿಮೂರನೆ | ಹದಿಮೂರನೆಯ | ಥರ್ಟೀನ್ | ಥರ್ಟೀಂಥ್ | ಹದಿಮೂರ್ | ಹದಿಮೂರನೇ | 13 ರ | 13ರ | 13 ರೊಳಗೆ | 13 ರಂದು | 13ನೇ | 13ಕ್ಕೆ | 13th ', ' 13 ', text)
        text = re.sub(r' ೧೪ | ಹದಿನಾಲ್ಕು | ಹದಿನಾಲ್ಕನೆ | ಹದಿನಾಲ್ಕನೆಯ | ಫೋರ್ಟೀನ್ | ಫೋರ್ಟೀಂತ್ | ಹದಿನಾಲ್ಕ್ | ಹದಿನಾಲ್ಕನೇ | ಫೋರ್ಟೀನ್ತ್ | 14 ರ | 14ರ | 14 ರೊಳಗೆ | 14 ರಂದು | 14ನೇ | 14ಕ್ಕೆ | 14th ', ' 14 ', text)
        text = re.sub(r' ೧೫ | ಹದಿನೈದು | ಹದಿನೈದನೆ | ಹದಿನೈದನೆಯ | ಫಿಫ್ಟೀನ | ಫಿಫ್ಟೀನ್ | ಫಿಫ್ಟೀಂಥ್  | ಹದಿನೈದ್ | ಹದಿನೈದಕ್ಕೆ | ಹದಿನೈದನೇ | 15ನೇ | 15 ರಂದು | 15 ರ | 15ರ | 15 ರೊಳಗೆ | 15ಕ್ಕೆ | 15th ', ' 15 ', text)
        text = re.sub(r' ೧೬ | ಹದಿನಾರು | ಹದಿನಾರನೆ | ಹದಿನಾರನೆಯ | ಸಿಕ್ಸ್ಟೀನ್ | ಸಿಕ್ಸ್ಟೀನ್ತ್ | ಹದಿನಾರ್ | ಹದಿನಾರನೇ | 16ನೇ | 16ಕ್ಕೆ | 16 ರ | 16ರ | 16 ರೊಳಗೆ | 16 ರಂದು | 16th ', ' 16 ', text)
        text = re.sub(r' ೧೭ | ಹದಿನೇಳು | ಹದಿನೇಳನೆಯ | ಹದಿನೇಳರ | ಸೆವೆಂಟಿನ್ | ಸೆವೆಂಟಿನ್ತ್ | ಹದಿನೇಳ್ | ಹದಿನೇಳನೇ | 17ನೇ | 17ಕ್ಕೆ | 17 ರ | 17ರ | 17 ರೊಳಗೆ | 17 ರಂದು | 17th ', ' 17 ', text)
        text = re.sub(r' ೧೮ | ಹದಿನೆಂಟು | ಹದಿನೆಂಟನೆಯ | ಹದಿನೆಂಟರ | ಏಟ್ಟೀನ್ | ಏಟ್ಟೀಂಥ್  | ಹದಿನೆಂಟ್ | ಹದಿನೆಂಟನೇ | 18ನೇ | 18ಕ್ಕೆ | 18 ರ | 18ರ | 18 ರೊಳಗೆ | 18 ರಂದು | 18th ', ' 18 ', text)
        text = re.sub(r' ೧೯ | ಹತೋಮಬತ್ತು | ನೈನ್ಟೀನ್ | ನೈನ್ ಟೀನ್ | ಹತೊಂಬತ್ತನೇ | ಹತೊಂಬತ್ತನೆ | ನೈನ್ಟೀಂತ್ | ಹತೊಂಬತ್ತಕ್ಕೆ | 19ನೇ | 19ಕ್ಕೆ | 19 ರ | 19ರ | 19 ರೊಳಗೆ | 19 ರಂದು | 19th ', ' 19 ', text)
        text = re.sub(r' ೨೦ | ಇಪ್ಪತ್ತು | ಇಪ್ಪತ್ತನೆಯ | ಇಪ್ಪತ್ತರ | ಟ್ವೆಂಟಿ | ಟ್ವೆಂಟಿತ್ | ಇಪ್ಪತ್ | ಇಪ್ಪತ್ತನೇ | ಟ್ವೆಂಟಿಯತ್ | 20ನೇ | 20ಕ್ಕೆ | 20 ರ | 20ರ | 20 ರೊಳಗೆ | 20 ರಂದು | 20th ', ' 20 ', text)
        text = re.sub(r' ೩೦ | ಮೂವತ್ತು | ಮೂವತ್ತನೆಯ | ಮೂವತ್ತಕ್ಕೆ | ಥರ್ಟಿ | ಥರ್ಟಿತ್ | ಮೌವತ್ | ಥರ್ಟಿಯತ್ | ಮೌವತ್ತನೇ | 30ನೇ | 30ಕ್ಕೆ | 30 ರ | 30ರ | 30 ರೊಳಗೆ | 30 ರಂದು | 30th ', ' 30 ', text)
        return text   

    def convert_bengali_text_to_int(self,text):
        text = re.sub(r'-', ' - ', text)                                    # To include the Interval days 
        text = re.sub(r' একুশ|একবিংশ | একুস | একুষ |টোয়েন্টি ওয়ান | টোয়েন্টি ফার্স্ট | 21st ', ' 21 ', text)
        text = re.sub(r' বাইশ| বাইস | টোয়েন্টি টূ | টোয়েন্টি সেকেন্ড | 22nd ', ' 22 ', text)
        text = re.sub(r' তেইশ| তেইস | টোয়েন্টি থার্ড | টোয়েন্টি থ্রি | 23rd ', ' 23 ', text)
        text = re.sub(r' চব্বিশ| চোববীস | চোব্বিশ | টোয়েন্টি ফোর্থ | টোয়েন্টি ফোর | 24th ', ' 24 ', text)
        text = re.sub(r' পঁচিশ| পঁচিস | টোয়েন্টি ফোর্থ | টোয়েন্টি ফাইভ | 25th ', ' 25 ', text)
        text = re.sub(r' ছাব্বিশ| টোয়েন্টি সিক্স | টোয়েন্টি সিক্সথ | 26th ', ' 26 ', text)
        text = re.sub(r' সাতাশ| সাতাইশ | টোয়েন্টি সেভেন্থ | টোয়েন্টি সেভেন | 27th ', ' 27 ', text)
        text = re.sub(r' আটাশ| আঠাশ| আটাস | টোয়েন্টি এইট | টোয়েন্টি এইট্থ | 28th ', ' 28 ', text)
        text = re.sub(r' ঊনত্রিশ| ঊনতিরিশ | টোয়েন্টি নাইন | টোয়েন্টি নাইন্থ | 29th ', ' 29 ', text)
        text = re.sub(r' একত্রিশ| একতিরিশ | থার্টি ওয়ান | থার্টি ফার্স্ট | 31st ', ' 31 ', text)
        text = re.sub(r' এক| প্রথম | ওয়ান | ফার্স্ট | 1st ', ' 1 ', text)
        text = re.sub(r' দুই| দ্বিতীয় | টূ | সেকেন্ড | 2nd ', ' 2 ', text)
        text = re.sub(r' তিন| তৃতীয় | থার্ড | থ্রি | 3rd ', ' 3 ', text)
        text = re.sub(r' চার| চতুর্থ| চারই | ফোর | ফোর্থ | 4th ', ' 4 ', text)
        text = re.sub(r' পাঁচ| পাচ| পঞ্চম | পাঁচই | পাচই | ফাইভ |ফিফথ | 5th ', ' 5 ', text)
        text = re.sub(r' ছয়|ষষ্ঠ | ছইয়ে | সিক্স | সিক্সথ | 6th ', ' 6 ', text)
        text = re.sub(r' সাত|সপ্তম | সাতই | সেভেন | সেভেন্থ | 7th ', ' 7 ', text)
        text = re.sub(r' আট| আঠ | অষ্টম | আটই | আঠই | এইট | এইট্থ | 8th ', ' 8 ', text)
        text = re.sub(r' নয়| ন | নয়ে | নয়ই | নবম | নাইন | নাইন্থ | 9th ', ' 9 ', text)
        text = re.sub(r' দশ| দশম | দশই | দশয় | টেন | টেন্থ | 10th ', ' 10 ', text)
        text = re.sub(r' এগারো| একাদশ | এগারোই | ইলেভেন | ইলেভেন্থ | 11th ', ' 11 ', text)
        text = re.sub(r' বারো| দ্বাদশ | বারই | টুওয়েল্ভ | 12th ', ' 12 ', text)
        text = re.sub(r' তেরো| ত্রয়োদশ | থার্টিন | থার্টিন্থ | 13th ', ' 13 ', text)
        text = re.sub(r' চৌদ্দ| চোদ্দ | চোদ্দো | চদ্দো | চতুর্দশ | ফোর্টীন | ফোর্টীন্থ | 14th ', ' 14 ', text)
        text = re.sub(r' পনেরো| পনোর | পনোরো | পঞ্চদশ | ফিফটীন | ফিফটীন্থ | 15th ', ' 15 ', text)
        text = re.sub(r' ষোলো| ষোড়শ | সিক্সটিন্থ | 16th ', ' 16 ', text)
        text = re.sub(r' সতেরো| সপ্তদশ | সেভেনটিন | সেভেনটিন্থ | 17th ', ' 17 ', text)
        text = re.sub(r' আঠারো| অষ্টাদশ | আঠোরো | এইট্টীন্থ | এইট্টীন | এইটিন | 18th ', ' 18 ', text)
        text = re.sub(r' উনিশ| ঊনবিংশ | নাইনটিন | নাইনটিন্থ | 19th ', ' 19 ', text)
        text = re.sub(r' বিশ| কুড়ি | বিংশ | টোয়েন্টি | টোয়েন্টিয়েথ |20th ', ' 20 ', text)
        text = re.sub(r' ত্রিশ| তিরিশ | থার্টি | থার্টিয়েত | 30th ', ' 30 ', text)
        return text

    def convert_punjabi_text_to_int(self,text):
        text = re.sub(r'-', ' - ', text)                                    # To include the Interval days 
        text = re.sub(r' ਇੱਕੀ | ਟ੍ਵੇਨ੍ਟੀ ਵਨ | ਟ੍ਵੇਨ੍ਟੀ ਫਰ੍ਸ੍ਟ | 21st ', ' 21 ', text)
        text = re.sub(r' ਬਾਈ | ਟ੍ਵੇਨ੍ਟੀ ਟੂ | ਟ੍ਵੇਨ੍ਟੀ ਸੇਕਨ੍ਡ | 22nd ', ' 22 ', text)
        text = re.sub(r' ਤੇਈ | ਟ੍ਵੇਨ੍ਟੀ ਥ੍ਰੀ | ਟ੍ਵੇਨ੍ਟੀ ਥਰ੍ਡ | 23rd ', ' 23 ', text)
        text = re.sub(r' ਚੌਵੀ | ਟ੍ਵੇਨ੍ਟੀ ਫੋਰ | ਟ੍ਵੇਨ੍ਟੀ ਫੌਰ | ਟ੍ਵੇਨ੍ਟੀ ਫੌਰ੍ਥ | ਟ੍ਵੇਨ੍ਟੀ ਫੋਰ੍ਥ | 24th ', ' 24 ', text)
        text = re.sub(r' ਪੱਚੀ | ਟ੍ਵੇਨ੍ਟੀ ਫਾਇਵ | ਟ੍ਵੇਨ੍ਟੀ ਫਿਫ੍ਥ  | ਟ੍ਵੇਨ੍ਟੀ ਫਿਥ | 25th ', ' 25 ', text)
        text = re.sub(r' ਛੱਬੀ | ਟ੍ਵੇਨ੍ਟੀ ਸਿਕ੍ਸ | ਟ੍ਵੇਨ੍ਟੀ ਸਿਕ੍ਸ੍ਥ | 26th ', ' 26 ', text)
        text = re.sub(r' ਸਤਾਈ | ਟ੍ਵੇਨ੍ਟੀ ਸੇਵਨ | ਟ੍ਵੇਨ੍ਟੀ ਸੇਵਨ੍ਥ | 27th ', ' 27 ', text)
        text = re.sub(r' ਅਠਾਈ | ਟ੍ਵੇਨ੍ਟੀ ਏਟ | ਟ੍ਵੇਨ੍ਟੀ ਐਟ | ਟ੍ਵੇਨ੍ਟੀ ਏਟ੍ਥ | ਟ੍ਵੇਨ੍ਟੀ ਐਟ੍ਥ | ਟ੍ਵੇਨ੍ਟੀ ਐਥ | 28th ', ' 28 ', text)
        text = re.sub(r' ਉਨੱਤੀ | ਟ੍ਵੇਨ੍ਟੀ ਨਾਇਨ | ਟ੍ਵੇਨ੍ਟੀ ਨਾਇਨ੍ਥ | 29th ', ' 29 ', text)
        text = re.sub(r' ਇਕੱਤੀ | ਥਰ੍ਟੀ ਵਨ | ਥਰ੍ਟੀ ਫਰ੍ਸ੍ਟ | 31st ', ' 31 ', text)
        text = re.sub(r' ਵਨ | ਇੱਕ | ਫਰ੍ਸ੍ਟ | ਫਸਟ | ਪਹਿਲੀ | 1st ', ' 1 ', text)
        text = re.sub(r' ਦੋ | ਟੂ | ਸੇਕਨ੍ਡ | ਸੇਕਨ | 2nd ', ' 2 ', text)
        text = re.sub(r' ਤਿੰਨ | ਥ੍ਰੀ | ਥਰ੍ਡ | 3rd ', ' 3 ', text)
        text = re.sub(r' ਚਾਰ | ਫੌਰ੍ਥ | ਫੋਰ੍ਥ | ਚੌਥੀ | ਚੌਥਾ | 4th ', ' 4 ', text)
        text = re.sub(r' ਪੰਜ | ਪੰਜਵੀਂ | ਫਿਫ੍ਥ | 5th ', ' 5 ', text)
        text = re.sub(r' ਛੇ | ਸਿਕ੍ਸ੍ਥ | ਛੇਵੀਂ | ਛਟੀ | ਸਿਕ੍ਸ | 6th ', ' 6 ', text)
        text = re.sub(r' ਸੱਤ | ਸੇਵਨ | ਸਤਵੀਂ | ਸੇਵਨ੍ਥ | 7th ', ' 7 ', text)
        text = re.sub(r' ਅੱਠ | ਏਟ | ਐਟ | ਏਟ੍ਥ | ਐਟ੍ਥ | ਐਥ  | 8th ', ' 8 ', text)
        text = re.sub(r' ਨੌਂ | ਨਾਇਨ | ਨਾਇਨ੍ਥ | ਨੌਂਵਾਂ | 9th ', ' 9 ', text)
        text = re.sub(r' ਦਸ | ਦਸਵੀਂ | ਟੇਨ੍ਥ | ਦਸਵਾਂ | ਦਸਵੇਂ | ਟੇਨ | 10th ', ' 10 ', text)
        text = re.sub(r' ਗਿਆਰਾਂ | ਇਲੇਵਨ੍ਥ | ਈਲੇਵਨ੍ਥ | ਆਥਣ | ਇਲੇਵਨ | ਈਲੇਵਨ | 11th ', ' 11 ', text)
        text = re.sub(r' ਬਾਰ੍ਹਾਂ | ਬਾਰਵਾਂ | ਟ੍ਵੇਲ੍ਫ੍ਥ | ਟ੍ਵੈਲਥ | ਟ੍ਵੇਲ੍ਵ | 12th ', ' 12 ', text)
        text = re.sub(r' ਤੇਰ੍ਹਾਂ | ਤੇਰਾਂ | ਥਰ ਟੀਨ | ਥਰ੍ਟੀਨ | ਥਰ੍ਟੀਨ੍ਥ | 13th ', ' 13 ', text)
        text = re.sub(r' ਚੌਦਾਂ | ਚੌਦ੍ਹਾਂ | ਫੌਰ੍ਟੀਨ | ਫੋਰ੍ਟੀਨ | ਫੌਰ੍ਟੀਨ | ਫੌਰ੍ਟੀਨ੍ਥ | ਫੋਰ੍ਟੀਨ੍ਥ | ਫੌਰ੍ਟੀਨ੍ਥ | 14th ', ' 14 ', text)
        text = re.sub(r' ਪੰਦਰਾਂ | ਫਿਫ੍ਟੀਨ | ਫਿਫ੍ਟੀਨ੍ਥ | 15th ', ' 15 ', text)
        text = re.sub(r' ਸੋਲ੍ਹਾਂ | ਸੋਲ੍ਹਵਾਂ | ਸਿਕ੍ਸ੍ਟੀਨ੍ਥ | ਸਿਕ੍ਸ੍ਟੀਨ | 16th ', ' 16 ', text)
        text = re.sub(r' ਸਤਾਰਾਂ | ਸੇਵਨ੍ਟੀਨ | ਸੇਵਨ੍ਟੀਨ੍ਥ | ਸਤਾਰ੍ਹਵਾਂ | ਸਤਾਰ੍ਹਵੇਂ | 17th ', ' 17 ', text)
        text = re.sub(r' ਅਠਾਰਾਂ | ਅਠਾਰ੍ਹਾਂ | ਏਟੀਨ | ਐਟੀਨ | ਐਟੀਨ | ਅਠਾਰਵੀਂ | ਏਟੀਨ੍ਥ | ਐਟੀਨ੍ਥ | ਐਟੀਨ੍ਥ | 18th ', ' 18 ', text)
        text = re.sub(r' ਉੱਨੀ | ਉਨੀ | ਨਾਇਨ੍ਟੀਨ | ਉੱਨੀਵੀਂ | ਉੱਨ੍ਹੀਵਾਂ | ਉੱਨੀਵਾਂ | ਨਾਇਨ੍ਟੀਨ੍ਥ | 19th ', ' 19 ', text)
        text = re.sub(r' ਵੀਹ | ਬੀਹ | ਟ੍ਵੇਨ੍ਟੀ | ਟ੍ਵੇਨੀ | ਵੀਹਵੀਂ | ਵੀਹਵਾਂ | ਟ੍ਵੇਨ੍ਟੀਅਥ | ਟ੍ਵੇਨ੍ਟੀਇਥ | ਟ੍ਵੇਨ੍ਟੀਇਥ | ਟ੍ਵੇਨੀਅਥ | ਟ੍ਵੇਨੀਇਥ | ਵੀਹਾਂ | 20th ', ' 20 ', text)
        text = re.sub(r' ਤੀਹ | ਤੀਹਾਂ | ਥਰ੍ਟੀ | ਥਰ੍ਡੀ | ਥਰ੍ਟੀ | ਤੀਹਵਾਂ | ਥਰ੍ਟੀਅਥ | ਥਰ੍ਟੀਇਥ | ਥਰ੍ਟੀਇਥ | 30th ', ' 30 ', text)
        return text

    def convert_english_text_to_int(self, text):
        text = re.sub(r'-', ' - ', text)                                    # To include the Interval days 
        text = re.sub(r' twenty one | ikkis | twenty first | 21st | twenty first ', ' 21 ', text)
        text = re.sub(r' twenty two | baais | twenty second | 22nd | twenty second ', ' 22 ', text)
        text = re.sub(r' twenty three | taish | tais | taish | twenty third | 23rd | twenty third ', ' 23 ', text)
        text = re.sub(r' twenty four | chaubis | chaubees | twenty fourth | 24th | twenty fourth ', ' 24 ', text)
        text = re.sub(r' twenty five | pachees | pachis | twenty fifth | 25th | twenty fifth ', ' 25 ', text)
        text = re.sub(r' twenty six | chabbis | twenty sixth | 26th | twenty sixth ', ' 26 ', text)
        text = re.sub(r' twenty seven | satais | twenty seventh | 27th | twenty seventh ', ' 27 ', text)
        text = re.sub(r' twenty eight | athais | twenty eight | 28th | twenty eighth ', ' 28 ', text)
        text = re.sub(r' twenty nine | untees | twenty ninth | 29th | twenty ninth ', ' 29 ', text)
        text = re.sub(r' thirty one | tees | thirty first | 31st | thirty first ', ' 31 ', text)
        text = re.sub(r' one | ek | aik | first | 1st ', ' 1 ', text)
        text = re.sub(r' two | do | second | 2nd ', ' 2 ', text)
        text = re.sub(r' three | tin | tino | third | 3rd ', ' 3 ', text)
        text = re.sub(r' four | chaar | char | fourth | 4th ', ' 4 ', text)
        text = re.sub(r' five | paanch | fifth | 5th ', ' 5 ', text)
        text = re.sub(r' six | che | sixth | 6th ', ' 6 ', text)
        text = re.sub(r' seven | saat | seventh | 7th ', ' 7 ', text)
        text = re.sub(r' eight | aath | eighth | 8th ', ' 8 ', text)
        text = re.sub(r' nine | naw | nawve | ninth | 9th ', ' 9 ', text)
        text = re.sub(r' ten | das | daswe | dasve | tenth | 10th ', ' 10 ', text)
        text = re.sub(r' eleven | gyarah | gyarwe | gyarve | eleventh | 11th ', ' 11 ', text)
        text = re.sub(r' twelve | baarah | barah | barvi | barwi | baarwih | baarvih | baarhavi | baarhawi | twenth | twelveth | twelfth | 12th ', ' 12 ', text)
        text = re.sub(r' thirteen | terah | teravi | terawi | tehravi | tehrawi | thirteenth | 13th ', ' 13 ', text)
        text = re.sub(r' fourteen | chawda | chouda | choudah | chudwi | chaudwi | fourteenth | 14th ', ' 14 ', text)
        text = re.sub(r' fifteen | pandrah | pandra | fifteenth | 15th ', ' 15 ', text)
        text = re.sub(r' sixteen | sola | solah | sixteenth | 16th ', ' 16 ', text)
        text = re.sub(r' seventeen | satrah | satra | seventeenth | 17th ', ' 17 ', text)
        text = re.sub(r' eighteen | atharah | athara | athra | athrah | atharvi | atharwi | eighteenth | 18th ', ' 18 ', text)
        text = re.sub(r' nineteen | unees | unnes | unnees | uneesvi | uneeswi | ninteenth | 19th ', ' 19 ', text)
        text = re.sub(r' twenty | bees | beeswi | beesvi | twentieth | 20th ', ' 20 ', text)
        text = re.sub(r' thirty | teeswi | tesvi | tees | thirteeth | thirtieth | 30th ', ' 30 ', text)
        return text

    def convert_gujarati_text_to_int(self, text):
        text = re.sub(r'-', ' - ', text)                                    # To include the Interval days 
        text = re.sub(r' એકવીશ | એકવીસ | ટ્વેંટી ફસ્ટ | 21st | 21મી | ૨૧મી ', ' 21 ', text)
        text = re.sub(r' બાવીસ | બાવીશ | બાવી | ટ્વેંટી સેકન્ડ | 22nd | 22મી | ૨૨મી ', ' 22 ', text)
        text = re.sub(r' ત્રેવીસ | ત્રેવીસ | તેવીસ | તેવીશ | ત્રેવી | ટ્વેંટી થર્ડ | 23rd | 23મી | ૨૩મી ', ' 23 ', text)
        text = re.sub(r' ચોવીસ | ચોવીશ | ચોવી | ટ્વેંટી ફોર્થ | 24th | 24મી | ૨૪મી ', ' 24 ', text)
        text = re.sub(r' પચ્ચીસ | પચ્ચીશ | પચીસ | પચીશ | પચી | ટ્વેંટી ફિફ્થ | 25th | 25મી | ૨૫મી ', ' 25 ', text)
        text = re.sub(r' છવીસ | છવ્વીસ | છવીશ | છવ્વીશ | ટ્વેંટી સિક્સથ | 26th | 26મી | ૨૬મી ', ' 26 ', text)
        text = re.sub(r' સતાવીસ | સતાવીશ | સત્યાવીસ | સત્યાવીશ | સતાવી | ટ્વેંટી સેવન્થ | 27th | 27મી | ૨૭મી ', ' 27 ', text)
        text = re.sub(r' અઠાવીસ | અઠાવીશ | અઠ્યાવીસ | અઠ્યાવિશ | ટ્વેંટી એઠ | 28th | 28મી | ૨૮મી ', ' 28 ', text)
        text = re.sub(r' ઓગણત્રીસ | ઓગણત્રીશ | ટ્વેંટી નાઈન્થ | 29th | 29મી | ૨૯મી ', ' 29 ', text)
        text = re.sub(r' એકત્રીસ | એકત્રીશ | થર્ટી ફસ્ટ | 31st | 31મી | ૩૧મી ', ' 31 ', text)
        text = re.sub(r' વન | એક | પેલી | પેહલી | પહેલી | ફર્સ્ટ | ફસ્ટ | 1st | 1લી | ૧લી ', ' 1 ', text)
        text = re.sub(r' ટૂ | બે | બીજા | બીજી | સેકન્ડ | 2nd | 2જી | ૨જી ', ' 2 ', text)
        text = re.sub(r' થ્રી | ત્રણ | ત્રીજા | ત્રીજી | થર્ડ | 3rd | 3જી | ૩જી ', ' 3 ', text)
        text = re.sub(r' ચાર | ચોથી | ચોથા | ફોર્થ | 4th | 4થી | ૪થી ', ' 4 ', text)
        text = re.sub(r' પાચ | પાચમી | પાંચમી | પાંચ | પાચમાં | પાંચમાં | ફિફ્થ | 5th | 5મી | ૫મી ', ' 5 ', text)
        text = re.sub(r' છ | છઠ્ઠી |છઠી | છટ્ઠી | સિક્સથ | સિક્સ | 6th | 6ઠી | ૬ઠી ', ' 6 ', text)
        text = re.sub(r' સાત | સાતમાં | સાતમી | સેવન્થ | 7th | 7મી | ૭મી ', ' 7 ', text)
        text = re.sub(r' આઠ | આથમી | આઠમો | આઠ્મો | એટ્થ | 8th | 8મી | ૮મી ', ' 8 ', text)
        text = re.sub(r' નવ | નવમી | નવમાં | નૌમાં | નૌમી | નાઈન્થ | 9th | 9મી | ૯મી ', ' 9 ', text)
        text = re.sub(r' દસ | દસમી | દશમી | દસમાં | દશમાં | દસમા | ટેન્થ | 10th | 10મી | ૧૦મી ', ' 10 ', text)
        text = re.sub(r' અગ્યાર | અગિયાર | અગ્યારમી | અગિયારમી | અગ્યારમાં | અગીયારમાં | ઈલેવંથ | 11th | 11મી | ૧૧મી ', ' 11 ', text)
        text = re.sub(r' બાર | બારમાં | બારમી | ટ્વેલથ | 12th | 12મી | ૧૨મી ', ' 12 ', text)
        text = re.sub(r' તેર | તેરમી | તેરમાં | થર્ટીન્થ | 13th | 13મી | ૧૩મી ', ' 13 ', text)
        text = re.sub(r' ચૌદ | ચઉદ | ચૌદમી | ફોર્ટિંન્થ | 14th | 14મી | ૧૪મી ', ' 14 ', text)
        text = re.sub(r' પંદર | પન્દર | પંદરમી | ફિફ્ટીન્થ | 15th | 15મી | ૧૫મી ', ' 15 ', text)
        text = re.sub(r' સોળ | સોળમી | સિક્સટીન્થ | 16th | 16મી | ૧૬મી ', ' 16 ', text)
        text = re.sub(r' સતર | સતરમી | સેવન્ટીન્થ | 17th | 17મી | ૧૭મી ', ' 17 ', text)
        text = re.sub(r' અઢાર | અઢારમી | એટીન્થ | 18th | 18મી | ૧૮મી ', ' 18 ', text)
        text = re.sub(r' ઓગણીસ | ઓગણીશ | ઓગણીસમી | ઓગણીશમી | નાઈનટિંથ | 19th | 19મી | ૧૯મી ', ' 19 ', text)
        text = re.sub(r' વીસ | વિશ | વિષ | વીસમી | વિશમી | ટ્વેંટીથ | 20th | 20મી | ૨૦મી ', ' 20 ', text)
        text = re.sub(r' ત્રીસ | ત્રીશ | તીસ | તીશ | ત્રીસમી | ત્રીશમી | તીસમી | તીશમી | થર્ટીએથ | 30th | 30મી | ૩૦મી ', ' 30 ', text)
        return text

    def convert_oriya_text_to_int(self, text):
        text = re.sub(r'-', ' - ', text)                                    # To include the Interval days 
        text = re.sub(r' ଏକୋଇଶି | ଟ୍ୱେଣ୍ଟି ଫାର୍ଷ୍ଟ  | 21st ', ' 21 ', text)
        text = re.sub(r' ବାଇଶି | ଟ୍ୱେଣ୍ଟି ସେକେଣ୍ଡ | 22nd ', ' 22 ', text)
        text = re.sub(r' ତେଇଶି | ଟ୍ୱେଣ୍ଟି ଥାର୍ଡ଼ | 23rd ', ' 23 ', text)
        text = re.sub(r' ଚବିଶି | ଟ୍ୱେଣ୍ଟି ଫୋର୍ଥ | 24th ', ' 24 ', text)
        text = re.sub(r' ପଚିଶି | ଟ୍ୱେଣ୍ଟି  | 25th ', ' 25 ', text)
        text = re.sub(r' ଛବିଶି | ଟ୍ୱେଣ୍ଟି ସିକ୍ସ | 26th ', ' 26 ', text)
        text = re.sub(r' ସତାଇଶି | ଟ୍ୱେଣ୍ଟି ସେବେନ | 27th ', ' 27 ', text)
        text = re.sub(r' ଅଠାଇଶି | ଟ୍ୱେଣ୍ଟି ଏଇଟ | 28th ', ' 28 ', text)
        text = re.sub(r' ଅଣତିରିଶି | ଟ୍ୱେଣ୍ଟି ନଇଁଥ | 29th ', ' 29 ', text)
        text = re.sub(r' ଏକତିରିଶି | ଟ୍ୱେଣ୍ଟି ଫାର୍ଷ୍ଟ | 31st ', ' 31 ', text)
        text = re.sub(r' ଏକ | ପ୍ରଥମ | ପହିଲା | ପହିଲି | ଫାର୍ଷ୍ଟ | ବନ | 1st ', ' 1 ', text)
        text = re.sub(r' ଦୁଇ | ଦ୍ଵିତୀୟ | ଦୁଇଟା | ସେକେଣ୍ଡ | 2nd ', ' 2 ', text)
        text = re.sub(r' ତିନି | ତୃତୀୟ | ତିନିଟା | ଥାର୍ଡ଼ | 3rd ', ' 3 ', text)
        text = re.sub(r' ଚାରି | ଚତୁର୍ଥ | ଫୋରଥ | 4th ', ' 4 ', text)
        text = re.sub(r' ପାଞ୍ଚ | ପଞ୍ଚମ | ଫିଫଥ | 5th ', ' 5 ', text)
        text = re.sub(r' ଛଅ | ଷଷ୍ଠ | ସିକ୍ସଥ | 6th ', ' 6 ', text)
        text = re.sub(r' ସାତ | ସପ୍ତମ | ସେବେନଥ | 7th ', ' 7 ', text)
        text = re.sub(r' ଆଠ | ଅଷ୍ଟମ | ଏଇଥ | 8th ', ' 8 ', text)
        text = re.sub(r' ନଅ | ନବମ | ନଇଁଥ | 9th ', ' 9 ', text)
        text = re.sub(r' ଦଶ | ଦଶମ | ଟେଂଥ୍ | 10th ', ' 10 ', text)
        text = re.sub(r' ଏଗାର | ଇଲେଭେନଥ | 11th ', ' 11 ', text)
        text = re.sub(r' ବାର | ଟ୍ୱେଲଥ | 12th ', ' 12 ', text)
        text = re.sub(r' ତେର | ଥାର୍ଟିଂଥ  | 13th ', ' 13 ', text)
        text = re.sub(r' ଚଉଦ | ଫର୍ଟିନ| 14th ', ' 14 ', text)
        text = re.sub(r' ପନ୍ଦର | ଫିପଟିନ | 15th ', ' 15 ', text)
        text = re.sub(r' ଷୋହଳ | ସିକ୍ସଟିନ | 16th ', ' 16 ', text)
        text = re.sub(r' ସତର | ସେବେନଟିନ| 17th ', ' 17 ', text)
        text = re.sub(r' ଅଠର | ଏଟିନଥ | 18th ', ' 18 ', text)
        text = re.sub(r' ଊଣାଇଶ | ନାଇନଟିନଥ | 19th ', ' 19 ', text)
        text = re.sub(r' କୋଡିଏ | ଟ୍ବେନଟିଏଥ | 20th ', ' 20 ', text)
        text = re.sub(r' ତିରିଶି | ଥରଟିଏଥ | 30th ', ' 30 ', text)
        return text


def get_ner_prediction_text(text, ner):
    response = []
    temp = []
    text = text.split()
    # print(text, ner)
    for i in range(min(len(text), len(ner))):
        if ner[i] == "B-date":
            temp.append(text[i])
        elif ner[i] == "I-date":
            temp.append(text[i])
        elif ner[i] == "L-date":
            temp.append(text[i])
            new_string = " ".join(temp)
            response.append(new_string)
            temp = []
        elif ner[i] == "U-date":
            temp.append(text[i])
            new_string = " ".join(temp)
            response.append(new_string)
            temp = []
        else:
            if len(temp) == 0:
                continue
            else:
                new_string = " ".join(temp)
                response.append(new_string)
                temp = []
    return response

def get_ner_prediction_text_new(text: str, label: List[str], entity_list: List[str]):
    response = DefaultDict()
    text = text.split()
    
    for entity in entity_list:
        response[entity] = []

    for j, entity in enumerate(entity_list):
        temp = []
        for i in range(min(len(text), len(label))):
            if label[i].find(entity)!=-1:
                temp.append(text[i])
            else:
                if len(temp) == 0:
                    continue
                else:
                    new_string = " ".join(temp)
                    if new_string!= "":
                        response[entity].append(new_string)
                    temp = []
        if label[i] != "O":
            new_string = " ".join(temp)
            if new_string!= "":
                response[entity].append(new_string)
    return response


def get_match_length(text: str, lang: str = "hindi"):
    total_length = 0
    for sub_text in text:
        if type(sub_text) == tuple:
            temp = 0
            for single_tuple in sub_text:
                if single_tuple != "":
                    if lang == "hindi" or lang == "marathi" or lang == "english" or lang == "punjabi":
                        temp += len(single_tuple.split())
                    else:
                        temp += len(single_tuple)
            if total_length < temp:
                total_length = temp 
            # total_length = max(total_length, temp)
        else:
            if lang == "hindi" or lang == "marathi" or lang == "english" or lang == "punjabi":
                total_length += len(sub_text.split())
            else:            
                total_length += len(sub_text)

    return total_length

def max_length_match(text, lang = "hindi"):
    total_length = 0
    max_match = ""
    for sub_text in text:
        if type(sub_text) == tuple:         # Check whether there are multiple matches or not 
            temp = 0
            temp_text = ""
            for single_tuple in sub_text:                       # Check for each match
                if single_tuple != "":
                    if lang == "hindi":
                        temp_text += 1
                    else:
                        temp_text += len(single_tuple)
            if total_length < temp:
                total_length = temp 
                max_match = temp_text
        else:                                               # if single match then we will run this 
            total_length += len(sub_text.strip())
            if len(sub_text)>0:
                max_match += sub_text.strip() + " "

    max_match = max_match.strip()
    if total_length >= 1:                      
        return max_match, total_length + len(max_match.split()) - 1         # this will return the max match sentence and the total length of the match including spaces in between words
    else:
        return max_match, total_length


def get_abs_path(rel_path):
    """
    Get absolute path

    Args:
        rel_path: path relative to root of repo
        
    Returns absolute path
    """
    path = os.getenv("AZURE_SOURCE_DIRECTORY")
    deployed_in_container = os.path.isdir("/var/azureml-app/")
    
    if deployed_in_container:
        if path is None:
            path = "/var/azureml-app/saarthi-ner"
            print(f"Environment variable AZURE_SOURCE_DIRECTORY not set, but /var/azureml-app/ exists, defaulting to {path}")
        
        data_file_path = os.path.join(path, rel_path)
        return data_file_path
    
    return os.path.join(os.path.dirname(os.path.abspath(__file__)), "/Users/shubhamchaurasia/Documents/NER/saarthi_ner/saarthi_ner/src", rel_path)




def has_string_element(lst: str) -> bool:
    """
    Check if the list contains any string element or not
    """
    for elem in lst:
        if isinstance(elem, str):
            return True
    return False


def get_minimum_valid_value(lst: Tuple[List[Any], List[Any]]) -> Tuple[List[int], List[int]]:
    """
    Gives the minimum value out of a list by comparing each element. 
    Args:
        lst (List[Any]): It will have a list with two values at each index.

    Returns:
        Tuple[List[int], List[int]]: Return list with two walues first is the minimun value which we are comparing, 
                                    second is the other value which is associated at that index value
    """
    time, time_module = lst[0], lst[1]

    # Initialize minimum date and value
    min_date_time = time[0]
    min_value = time_module[0]

    # Loop through the list of tuples
    for i in range(1, len(time)):
        # Update the minimum date and value if necessary
        if time[i] < min_date_time:
            min_date_time = time[i]
            min_value = time_module[i]
    return (min_date_time, min_value)


def get_reverse_time_module(time_module: Any) -> str:
    if time_module == 1:
        return 'after'
    elif time_module == -1:
        return 'before'
    else:
        return 'at'
